## ✅ YES Plan Succeeded | `platform`
**Plan: 9 to add, 1 to change, 0 to destroy**
📍 `2.platform` | 🎯 [@infra-flash](https://github.com/wangzitian0/infra/pull/352#issuecomment-3686038863) | 💡 Run `atlantis apply -p platform`
<details><summary>📜 Output</summary>

```diff
infra-flash-commit:04b94c5 

Terragrunt already installed: terragrunt version v0.96.1

Cleaning old generated .tf files...
✅ Cleanup complete

10:08:08.733 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
10:08:08.862 INFO   terraform1.11.0: Initializing the backend...
10:08:08.972 INFO   terraform1.11.0: 
10:08:08.972 INFO   terraform1.11.0: Successfully configured the backend "s3"! Terraform will automatically
10:08:08.973 INFO   terraform1.11.0: use this backend unless the backend configuration changes.
10:08:09.142 INFO   terraform1.11.0: Initializing provider plugins...
10:08:09.142 INFO   terraform1.11.0: - terraform.io/builtin/terraform is built in to Terraform
10:08:09.142 INFO   terraform1.11.0: - Reusing previous version of hashicorp/random from the dependency lock file
10:08:09.351 INFO   terraform1.11.0: - Reusing previous version of hashicorp/helm from the dependency lock file
10:08:09.366 INFO   terraform1.11.0: - Reusing previous version of mastercard/restapi from the dependency lock file
10:08:09.605 INFO   terraform1.11.0: - Reusing previous version of hashicorp/time from the dependency lock file
10:08:09.617 INFO   terraform1.11.0: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
10:08:09.856 INFO   terraform1.11.0: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
10:08:09.875 INFO   terraform1.11.0: - Reusing previous version of hashicorp/http from the dependency lock file
10:08:10.113 INFO   terraform1.11.0: - Reusing previous version of alekc/kubectl from the dependency lock file
10:08:10.367 INFO   terraform1.11.0: - Reusing previous version of hashicorp/vault from the dependency lock file
10:08:10.612 INFO   terraform1.11.0: - Reusing previous version of hashicorp/null from the dependency lock file
10:08:10.763 INFO   terraform1.11.0: - Installing hashicorp/helm v2.17.0...
10:08:11.719 INFO   terraform1.11.0: - Installed hashicorp/helm v2.17.0 (signed by HashiCorp)
10:08:12.343 INFO   terraform1.11.0: - Installing cloudflare/cloudflare v4.52.5...
10:08:13.309 INFO   terraform1.11.0: - Installed cloudflare/cloudflare v4.52.5 (self-signed, key ID C76001609EE3B136)
10:08:13.374 INFO   terraform1.11.0: - Installing hashicorp/null v3.2.4...
10:08:13.726 INFO   terraform1.11.0: - Installed hashicorp/null v3.2.4 (signed by HashiCorp)
10:08:13.785 INFO   terraform1.11.0: - Installing hashicorp/random v3.7.2...
10:08:14.127 INFO   terraform1.11.0: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
10:08:14.985 INFO   terraform1.11.0: - Installing mastercard/restapi v1.20.0...
10:08:15.601 INFO   terraform1.11.0: - Installed mastercard/restapi v1.20.0 (self-signed, key ID DCB8C431D71C30AB)
10:08:15.669 INFO   terraform1.11.0: - Installing hashicorp/time v0.13.1...
10:08:16.032 INFO   terraform1.11.0: - Installed hashicorp/time v0.13.1 (signed by HashiCorp)
10:08:16.316 INFO   terraform1.11.0: - Installing hashicorp/kubernetes v2.38.0...
10:08:17.269 INFO   terraform1.11.0: - Installed hashicorp/kubernetes v2.38.0 (signed by HashiCorp)
10:08:17.325 INFO   terraform1.11.0: - Installing hashicorp/http v3.5.0...
10:08:17.668 INFO   terraform1.11.0: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
10:08:18.472 INFO   terraform1.11.0: - Installing alekc/kubectl v2.1.3...
10:08:19.715 INFO   terraform1.11.0: - Installed alekc/kubectl v2.1.3 (self-signed, key ID 772FB27A86DAFCE7)
10:08:20.023 INFO   terraform1.11.0: - Installing hashicorp/vault v4.8.0...
10:08:20.648 INFO   terraform1.11.0: - Installed hashicorp/vault v4.8.0 (signed by HashiCorp)
10:08:20.648 INFO   terraform1.11.0: Partner and community providers are signed by their developers.
10:08:20.649 INFO   terraform1.11.0: If you'd like to know more about provider signing, you can read about it here:
10:08:20.649 INFO   terraform1.11.0: https://www.terraform.io/docs/cli/plugins/signing.html
10:08:20.649 INFO   terraform1.11.0: Terraform has made some changes to the provider dependency selections recorded
10:08:20.649 INFO   terraform1.11.0: in the .terraform.lock.hcl file. Review those changes and commit them to your
10:08:20.649 INFO   terraform1.11.0: version control system if they represent changes you intended to make.
10:08:20.649 INFO   terraform1.11.0: Terraform has been successfully initialized!
10:08:20.650 INFO   terraform1.11.0: 
10:08:20.650 INFO   terraform1.11.0: You may now begin working with Terraform. Try running "terraform plan" to see
10:08:20.650 INFO   terraform1.11.0: any changes that are required for your infrastructure. All Terraform commands
10:08:20.650 INFO   terraform1.11.0: should now work.
10:08:20.650 INFO   terraform1.11.0: If you ever set or change modules or backend configuration for Terraform,
10:08:20.650 INFO   terraform1.11.0: rerun this command to reinitialize your working directory. If you forget, other
10:08:20.650 INFO   terraform1.11.0: commands will detect it and remind you to do so if necessary.
10:08:23.384 STDOUT terraform1.11.0: terraform_data.health_check_target[0]: Refreshing state... [id=ff153b72-191c-4599-018f-65a742e9eb4d]
10:08:23.386 STDOUT terraform1.11.0: terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
10:08:23.389 STDOUT terraform1.11.0: random_id.kubero_webhook_secret: Refreshing state... [id=dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI]
10:08:23.392 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Reading...
10:08:23.392 STDOUT terraform1.11.0: data.cloudflare_zone.internal: Reading...
10:08:23.392 STDOUT terraform1.11.0: vault_policy.kubero: Refreshing state... [id=kubero]
10:08:23.392 STDOUT terraform1.11.0: random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
10:08:23.396 STDOUT terraform1.11.0: vault_identity_group.viewer[0]: Refreshing state... [id=89e06fbb-fc87-9471-ecc7-04b5747e4b06]
10:08:23.398 STDOUT terraform1.11.0: random_id.kubero_session_secret: Refreshing state... [id=zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc]
10:08:23.399 STDOUT terraform1.11.0: vault_policy.developer[0]: Refreshing state... [id=developer]
10:08:23.399 STDOUT terraform1.11.0: random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
10:08:23.403 STDOUT terraform1.11.0: random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
10:08:23.406 STDOUT terraform1.11.0: data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
10:08:23.410 STDOUT terraform1.11.0: random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
10:08:23.414 STDOUT terraform1.11.0: vault_identity_group.admin[0]: Refreshing state... [id=0ac3b38e-52bb-3a86-d72d-71ad31784ee3]
10:08:23.415 STDOUT terraform1.11.0: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
10:08:23.417 STDOUT terraform1.11.0: vault_mount.kv: Refreshing state... [id=secret]
10:08:23.417 STDOUT terraform1.11.0: vault_identity_group.developer[0]: Refreshing state... [id=f7e4fa30-a522-c524-6927-6e0f8c21d4f3]
10:08:23.424 STDOUT terraform1.11.0: random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
10:08:23.429 STDOUT terraform1.11.0: vault_policy.admin[0]: Refreshing state... [id=admin]
10:08:23.431 STDOUT terraform1.11.0: vault_policy.viewer[0]: Refreshing state... [id=viewer]
10:08:23.431 STDOUT terraform1.11.0: vault_policy.default: Refreshing state... [id=default]
10:08:23.476 STDOUT terraform1.11.0: vault_mount.database: Refreshing state... [id=database]
10:08:23.480 STDOUT terraform1.11.0: kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
10:08:23.481 STDOUT terraform1.11.0: kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
10:08:23.482 STDOUT terraform1.11.0: helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
10:08:23.482 STDOUT terraform1.11.0: kubernetes_config_map.homer_config[0]: Refreshing state... [id=platform/homer-config]
10:08:23.484 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Reading...
10:08:23.488 STDOUT terraform1.11.0: helm_release.vault: Refreshing state... [id=vault]
10:08:23.495 STDOUT terraform1.11.0: data.kubernetes_secret.casdoor_builtin: Read complete after 0s [id=platform/casdoor-builtin-secret]
10:08:23.499 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/kubernetes/config]
10:08:23.499 STDOUT terraform1.11.0: vault_kubernetes_auth_backend_role.kubero: Refreshing state... [id=auth/kubernetes/role/kubero]
10:08:23.505 STDOUT terraform1.11.0: kubernetes_service.homer[0]: Refreshing state... [id=platform/homer]
10:08:23.510 STDOUT terraform1.11.0: vault_policy.reader[0]: Refreshing state... [id=reader]
10:08:23.586 STDOUT terraform1.11.0: vault_kv_secret_v2.kubero: Refreshing state... [id=secret/data/kubero]
10:08:23.593 STDOUT terraform1.11.0: helm_release.casdoor[0]: Refreshing state... [id=casdoor]
10:08:23.610 STDOUT terraform1.11.0: kubernetes_deployment.homer[0]: Refreshing state... [id=platform/homer]
10:08:23.672 STDOUT terraform1.11.0: kubernetes_ingress_v1.homer[0]: Refreshing state... [id=platform/homer-ingress]
10:08:24.245 STDOUT terraform1.11.0: kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
10:08:24.245 STDOUT terraform1.11.0: kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
10:08:24.249 STDOUT terraform1.11.0: kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
10:08:24.262 STDOUT terraform1.11.0: kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
10:08:24.262 STDOUT terraform1.11.0: kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
10:08:24.578 STDOUT terraform1.11.0: kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
10:08:24.735 STDOUT terraform1.11.0: data.cloudflare_zone.internal: Read complete after 2s [id=6e69310ba4000e47c0a2480e2606713a]
10:08:26.815 STDOUT terraform1.11.0: restapi_object.provider_github[0]: Refreshing state... [id=GitHub]
10:08:26.815 STDOUT terraform1.11.0: restapi_object.role_vault_developer[0]: Refreshing state... [id=vault-developer]
10:08:26.816 STDOUT terraform1.11.0: restapi_object.role_vault_viewer[0]: Refreshing state... [id=vault-viewer]
10:08:26.817 STDOUT terraform1.11.0: restapi_object.role_vault_admin[0]: Refreshing state... [id=vault-admin]
10:08:26.817 STDOUT terraform1.11.0: helm_release.portal_auth[0]: Refreshing state... [id=portal-auth]
10:08:26.907 STDOUT terraform1.11.0: restapi_object.app_dashboard_oidc[0]: Refreshing state... [id=dashboard-oidc]
10:08:26.909 STDOUT terraform1.11.0: restapi_object.app_portal_gate[0]: Refreshing state... [id=portal-gate]
10:08:26.909 STDOUT terraform1.11.0: restapi_object.app_kubero_oidc[0]: Refreshing state... [id=kubero-oidc]
10:08:26.909 STDOUT terraform1.11.0: restapi_object.app_vault_oidc[0]: Refreshing state... [id=vault-oidc]
10:08:27.069 STDOUT terraform1.11.0: data.http.casdoor_oidc_discovery[0]: Reading...
10:08:27.100 STDOUT terraform1.11.0: data.http.casdoor_oidc_discovery[0]: Read complete after 0s [id=https://sso.zitian.party/.well-known/openid-configuration]
10:08:27.110 STDOUT terraform1.11.0: vault_jwt_auth_backend.oidc[0]: Refreshing state... [id=oidc]
10:08:27.123 STDOUT terraform1.11.0: vault_identity_group_alias.developer_builtin[0]: Refreshing state... [id=b226a4ab-d852-cdd1-93ce-7d7e092789f8]
10:08:27.123 STDOUT terraform1.11.0: vault_identity_group_alias.admin_namespaced[0]: Refreshing state... [id=66caaff4-e04e-c728-b735-d5db69d7c1d7]
10:08:27.124 STDOUT terraform1.11.0: vault_identity_group_alias.developer_namespaced[0]: Refreshing state... [id=396fd6b1-b668-beb5-275d-d8ae7a7bb319]
10:08:27.127 STDOUT terraform1.11.0: vault_identity_group_alias.admin_builtin[0]: Refreshing state... [id=14fd69d1-3357-ee38-b7f1-1baea515ed39]
10:08:27.127 STDOUT terraform1.11.0: vault_identity_group_alias.admin_simple[0]: Refreshing state... [id=8c3db19d-3644-60fb-7920-9fa33a59a75f]
10:08:27.127 STDOUT terraform1.11.0: vault_identity_group_alias.developer_simple[0]: Refreshing state... [id=7d484dd5-8f8d-ff27-3a0a-0534aa02545f]
10:08:27.127 STDOUT terraform1.11.0: vault_identity_group_alias.viewer_namespaced[0]: Refreshing state... [id=969d321c-a291-c9ec-959f-6a1a9e8f0e4a]
10:08:27.128 STDOUT terraform1.11.0: vault_jwt_auth_backend_role.reader[0]: Refreshing state... [id=auth/oidc/role/reader]
10:08:27.128 STDOUT terraform1.11.0: vault_jwt_auth_backend_role.default[0]: Refreshing state... [id=auth/oidc/role/default]
10:08:27.133 STDOUT terraform1.11.0: vault_identity_group_alias.viewer_simple[0]: Refreshing state... [id=92486a21-3fee-265c-e473-4af5a5594f27]
10:08:27.606 STDOUT terraform1.11.0: time_sleep.wait_for_portal_auth[0]: Refreshing state... [id=2025-12-19T09:58:42Z]
10:08:27.618 STDOUT terraform1.11.0: data.http.portal_auth_ping[0]: Reading...
10:08:27.676 STDOUT terraform1.11.0: data.http.portal_auth_ping[0]: Read complete after 0s [id=https://auth.zitian.party/ping]
10:08:28.602 STDOUT terraform1.11.0: kubernetes_manifest.portal_auth_middleware_platform[0]: Refreshing state...
10:08:28.838 STDOUT terraform1.11.0: Terraform used the selected providers to generate the following execution
10:08:28.838 STDOUT terraform1.11.0: plan. Resource actions are indicated with the following symbols:
10:08:28.839 STDOUT terraform1.11.0:   + create
10:08:28.839 STDOUT terraform1.11.0:   ~ update in-place
10:08:28.839 STDOUT terraform1.11.0: Terraform will perform the following actions:
10:08:28.839 STDOUT terraform1.11.0:   # helm_release.vault_secrets_operator will be created
10:08:28.839 STDOUT terraform1.11.0:   + resource "helm_release" "vault_secrets_operator" {
10:08:28.839 STDOUT terraform1.11.0:       + atomic                     = false
10:08:28.839 STDOUT terraform1.11.0:       + chart                      = "vault-secrets-operator"
10:08:28.839 STDOUT terraform1.11.0:       + cleanup_on_fail            = true
10:08:28.839 STDOUT terraform1.11.0:       + create_namespace           = true
10:08:28.839 STDOUT terraform1.11.0:       + dependency_update          = false
10:08:28.839 STDOUT terraform1.11.0:       + disable_crd_hooks          = false
10:08:28.839 STDOUT terraform1.11.0:       + disable_openapi_validation = false
10:08:28.839 STDOUT terraform1.11.0:       + disable_webhooks           = false
10:08:28.839 STDOUT terraform1.11.0:       + force_update               = false
10:08:28.839 STDOUT terraform1.11.0:       + id                         = (known after apply)
10:08:28.839 STDOUT terraform1.11.0:       + lint                       = false
10:08:28.839 STDOUT terraform1.11.0:       + manifest                   = (known after apply)
10:08:28.839 STDOUT terraform1.11.0:       + max_history                = 0
10:08:28.839 STDOUT terraform1.11.0:       + metadata                   = (known after apply)
10:08:28.840 STDOUT terraform1.11.0:       + name                       = "vault-secrets-operator"
10:08:28.840 STDOUT terraform1.11.0:       + namespace                  = "vault-secrets-operator-system"
10:08:28.840 STDOUT terraform1.11.0:       + pass_credentials           = false
10:08:28.840 STDOUT terraform1.11.0:       + recreate_pods              = false
10:08:28.840 STDOUT terraform1.11.0:       + render_subchart_notes      = true
10:08:28.840 STDOUT terraform1.11.0:       + replace                    = false
10:08:28.840 STDOUT terraform1.11.0:       + repository                 = "https://helm.releases.hashicorp.com"
10:08:28.840 STDOUT terraform1.11.0:       + reset_values               = false
10:08:28.840 STDOUT terraform1.11.0:       + reuse_values               = false
10:08:28.840 STDOUT terraform1.11.0:       + skip_crds                  = false
10:08:28.840 STDOUT terraform1.11.0:       + status                     = "deployed"
10:08:28.840 STDOUT terraform1.11.0:       + timeout                    = 300
10:08:28.840 STDOUT terraform1.11.0:       + values                     = [
10:08:28.840 STDOUT terraform1.11.0:           + <<-EOT
10:08:28.840 STDOUT terraform1.11.0:                 "controller":
10:08:28.840 STDOUT terraform1.11.0:                   "manager":
10:08:28.840 STDOUT terraform1.11.0:                     "resources":
10:08:28.840 STDOUT terraform1.11.0:                       "limits":
10:08:28.840 STDOUT terraform1.11.0:                         "cpu": "200m"
10:08:28.840 STDOUT terraform1.11.0:                         "memory": "256Mi"
10:08:28.840 STDOUT terraform1.11.0:                       "requests":
10:08:28.840 STDOUT terraform1.11.0:                         "cpu": "50m"
10:08:28.840 STDOUT terraform1.11.0:                         "memory": "64Mi"
10:08:28.840 STDOUT terraform1.11.0:                 "defaultVaultConnection":
10:08:28.840 STDOUT terraform1.11.0:                   "address": "http://vault.platform.svc.cluster.local:8200"
10:08:28.840 STDOUT terraform1.11.0:                   "enabled": true
10:08:28.840 STDOUT terraform1.11.0:             EOT,
10:08:28.840 STDOUT terraform1.11.0:         ]
10:08:28.840 STDOUT terraform1.11.0:       + verify                     = false
10:08:28.840 STDOUT terraform1.11.0:       + version                    = "0.9.1"
10:08:28.841 STDOUT terraform1.11.0:       + wait                       = true
10:08:28.841 STDOUT terraform1.11.0:       + wait_for_jobs              = true
10:08:28.841 STDOUT terraform1.11.0:     }
10:08:28.841 STDOUT terraform1.11.0:   # restapi_object.role_vault_admin[0] will be updated in-place
10:08:28.841 STDOUT terraform1.11.0:   ~ resource "restapi_object" "role_vault_admin" {
10:08:28.841 STDOUT terraform1.11.0:       ~ data            = (sensitive value)
10:08:28.841 STDOUT terraform1.11.0:         id              = "vault-admin"
10:08:28.841 STDOUT terraform1.11.0:         # (10 unchanged attributes hidden)
10:08:28.841 STDOUT terraform1.11.0:     }
10:08:28.841 STDOUT terraform1.11.0:   # time_sleep.wait_for_vso_crd will be created
10:08:28.841 STDOUT terraform1.11.0:   + resource "time_sleep" "wait_for_vso_crd" {
10:08:28.841 STDOUT terraform1.11.0:       + create_duration = "30s"
10:08:28.841 STDOUT terraform1.11.0:       + id              = (known after apply)
10:08:28.841 STDOUT terraform1.11.0:     }
10:08:28.841 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_namespaced[0] will be created
10:08:28.841 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_namespaced" {
10:08:28.841 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
10:08:28.841 STDOUT terraform1.11.0:       + id             = (known after apply)
10:08:28.841 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
10:08:28.841 STDOUT terraform1.11.0:       + name           = "admin/vault-admin"
10:08:28.842 STDOUT terraform1.11.0:     }
10:08:28.842 STDOUT terraform1.11.0:   # vault_identity_group_alias.admin_simple[0] will be created
10:08:28.842 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "admin_simple" {
10:08:28.842 STDOUT terraform1.11.0:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
10:08:28.842 STDOUT terraform1.11.0:       + id             = (known after apply)
10:08:28.842 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
10:08:28.842 STDOUT terraform1.11.0:       + name           = "vault-admin"
10:08:28.842 STDOUT terraform1.11.0:     }
10:08:28.842 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_namespaced[0] will be created
10:08:28.842 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_namespaced" {
10:08:28.842 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
10:08:28.842 STDOUT terraform1.11.0:       + id             = (known after apply)
10:08:28.843 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
10:08:28.843 STDOUT terraform1.11.0:       + name           = "admin/vault-developer"
10:08:28.843 STDOUT terraform1.11.0:     }
10:08:28.843 STDOUT terraform1.11.0:   # vault_identity_group_alias.developer_simple[0] will be created
10:08:28.843 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "developer_simple" {
10:08:28.843 STDOUT terraform1.11.0:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
10:08:28.843 STDOUT terraform1.11.0:       + id             = (known after apply)
10:08:28.843 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
10:08:28.843 STDOUT terraform1.11.0:       + name           = "vault-developer"
10:08:28.843 STDOUT terraform1.11.0:     }
10:08:28.843 STDOUT terraform1.11.0:   # vault_identity_group_alias.viewer_simple[0] will be created
10:08:28.843 STDOUT terraform1.11.0:   + resource "vault_identity_group_alias" "viewer_simple" {
10:08:28.843 STDOUT terraform1.11.0:       + canonical_id   = "89e06fbb-fc87-9471-ecc7-04b5747e4b06"
10:08:28.843 STDOUT terraform1.11.0:       + id             = (known after apply)
10:08:28.843 STDOUT terraform1.11.0:       + mount_accessor = "auth_oidc_93901082"
10:08:28.844 STDOUT terraform1.11.0:       + name           = "vault-viewer"
10:08:28.844 STDOUT terraform1.11.0:     }
10:08:28.844 STDOUT terraform1.11.0:   # vault_kubernetes_auth_backend_role.vso will be created
10:08:28.844 STDOUT terraform1.11.0:   + resource "vault_kubernetes_auth_backend_role" "vso" {
10:08:28.844 STDOUT terraform1.11.0:       + alias_name_source                = (known after apply)
10:08:28.844 STDOUT terraform1.11.0:       + backend                          = "kubernetes"
10:08:28.844 STDOUT terraform1.11.0:       + bound_service_account_names      = [
10:08:28.844 STDOUT terraform1.11.0:           + "vault-secrets-operator-controller-manager",
10:08:28.844 STDOUT terraform1.11.0:         ]
10:08:28.844 STDOUT terraform1.11.0:       + bound_service_account_namespaces = [
10:08:28.844 STDOUT terraform1.11.0:           + "vault-secrets-operator-system",
10:08:28.844 STDOUT terraform1.11.0:         ]
10:08:28.844 STDOUT terraform1.11.0:       + id                               = (known after apply)
10:08:28.844 STDOUT terraform1.11.0:       + role_name                        = "vault-secrets-operator"
10:08:28.844 STDOUT terraform1.11.0:       + token_policies                   = [
10:08:28.844 STDOUT terraform1.11.0:           + "vso-reader",
10:08:28.844 STDOUT terraform1.11.0:         ]
10:08:28.844 STDOUT terraform1.11.0:       + token_ttl                        = 3600
10:08:28.844 STDOUT terraform1.11.0:       + token_type                       = "default"
10:08:28.844 STDOUT terraform1.11.0:     }
10:08:28.844 STDOUT terraform1.11.0:   # vault_policy.vso_reader will be created
10:08:28.844 STDOUT terraform1.11.0:   + resource "vault_policy" "vso_reader" {
10:08:28.844 STDOUT terraform1.11.0:       + id     = (known after apply)
10:08:28.845 STDOUT terraform1.11.0:       + name   = "vso-reader"
10:08:28.845 STDOUT terraform1.11.0:       + policy = <<-EOT
10:08:28.845 STDOUT terraform1.11.0:             # Read access to all KV secrets for syncing to K8s
10:08:28.845 STDOUT terraform1.11.0:             path "secret/data/*" {
10:08:28.845 STDOUT terraform1.11.0:               capabilities = ["read"]
10:08:28.845 STDOUT terraform1.11.0:             }
10:08:28.845 STDOUT terraform1.11.0:             path "secret/metadata/*" {
10:08:28.845 STDOUT terraform1.11.0:               capabilities = ["read", "list"]
10:08:28.845 STDOUT terraform1.11.0:             }
10:08:28.845 STDOUT terraform1.11.0:         EOT
10:08:28.845 STDOUT terraform1.11.0:     }
10:08:28.845 STDOUT terraform1.11.0: Plan: 9 to add, 1 to change, 0 to destroy.
10:08:28.845 STDOUT terraform1.11.0: 
10:08:28.845 STDOUT terraform1.11.0: Changes to Outputs:
10:08:28.845 STDOUT terraform1.11.0:   + vso_namespace                  = "vault-secrets-operator-system"
10:08:28.845 STDOUT terraform1.11.0: 
10:08:28.845 STDOUT terraform1.11.0: ─────────────────────────────────────────────────────────────────────────────
10:08:28.845 STDOUT terraform1.11.0: Saved the plan to:
10:08:28.845 STDOUT terraform1.11.0: ./platform-default.tfplan
10:08:28.845 STDOUT terraform1.11.0: To perform exactly these actions, run the following command to apply:
10:08:28.845 STDOUT terraform1.11.0:     terraform apply "./platform-default.tfplan"
```
</details>